ckeller42/kws-de/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64
CONFIG_WL_SECTOR_SIZE_4096=y
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
